In [1]:
import pandas as pd
import numpy as np

In [3]:
# dataframe using dictionary
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df=pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [11]:
# Dataframe using list  
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
pd.DataFrame(data_list)
# with list we need to pass columns manually otherwise will take 0 1 2 3 ....

columns=["Name","Age","City","Salary"]

In [14]:
pd.DataFrame(data_list,columns=columns)
# we can also provide custom row labels with passing index similar to series

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selection And Indexing

In [17]:
# can access data with column name 
df['Name']
df[['Name','Age']]

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

## Creating a Column

In [18]:
#  can create a column also 

df['Designation']=['Doctor','Engineer','Artist','Dancer']

In [19]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000      Artist
3  Linda   42    London   85000      Dancer

## Deleting a Column

In [27]:
df=df.drop('Designation',axis=1)
# in same way row can be delted axis=0 by default

KeyError: "['Designation'] not found in axis"

In [25]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selecting a Row

In [31]:
#  for Row loc function is used 
df.loc[0]
df.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

## Subsets of row and columns

In [34]:
df.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [36]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

## Conditional

In [37]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [38]:
# Only want people with age >30

# can be done in same way as numpy
bool_index=df['Age']>30

In [39]:
bool_index

0    False
1     True
2    False
3     True
Name: Age, dtype: bool

In [40]:
df[bool_index]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [41]:
df[df['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [47]:
df[(df['Age']>30) & (df['City']=='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000